
// See https://aka.ms/new-console-template for more information

Console.WriteLine("Hello, World!");
//1 Напишите программу, которая навход принимает
//число a 
//2 выдаёт его квадрат
Console.WriteLine("Ведите целое число");
int number = Convert.ToInt32(Console.ReadLine());
int square = number*number;
Console.WriteLine($"Квадрат числа {number} = {square}");



